[
   {
      "name":"Шифровальщик",
      "popUpText":"Шифровальщик (вымогатель, англ. Ransomware) -- разновидность компьютерного вируса, который шифрует файлы на жестком диске Вашего устройства. Для дешифровки злоумышленник просит перевести какую-либо сумму, обычно угрожая, что если сумма не будет переведена в кратчайшие сроки, то пользователь больше не получит доступа к своим файлам.\n Для примера злоумышленник может продемонстрировать успешную расшифровку одного-двух файлов, однако обольщаться не стоит: зачастую, даже заплатив требуемые деньги, пользователь не получает нужного результата.\n Чаще всего жертвами становятся неосторожные пользователи, которые к тому же используют нелицензионное ПО и не производят своевременных обновлений. Защитить от шифровальщика в некоторых ситуациях может антивирус, но наиболее оптимальной защитой является наличие регулярных бэкапов. Так, например, если Ваши файлы бэкапируются в облако, то шифровальщик Вам не так уж и страшен.",
      "popUpURL":"/glossary#attack_ransome"
   },
   {
      "name":"Кейлоггер",
      "popUpText":"Кейлоггер (англ. keylogger) -- разновидность компьютерного вируса, который регистрирует и сохраняет все нажатия клавиш, будь то данные учетных записей -- логины и пароли, или же данные банковских карт. Кейлоггеры бывают программными и аппаратными, встречаются среди них также легитимные: такие кейлоггеры ставятся организациями на компьютеры сотрудников, чтобы контролировать поток информации в рамках организации.\n \"Поймать\" кейлоггер довольно просто, чаще всего они используют уязвимости в имеющемся ПО и социальную инженерию, убеждая человека поставить какое-либо ПО обманным способом. Защитить от них может хорошая защитная система на Вашем компьютере и, разумеется, Ваша пользовательская осторожность.",
      "popUpURL":"/glossary#attack_keylogger"
   },
   {
      "name":"Удаленное выполнение кода",
      "popUpText":"Удаленное выполнение кода -- это действия, которые злоумышленник может совершить на Вашем компьютере, даже не имея к нему физического доступа. Так, например, уязвимость Eternalblue, которая легла в основу вируса WannaCry, позволяла злоумышленнику просматривать документы, делать снимки экрана и даже снимки с веб-камеры пользователя. Важно понимать, что если злоумышленник может выполнять код на Вашей системе, то в целом, он может сделать с ней все, что угодно. Чаще всего удаленное выполнение кода на Вашей машине возможно из-за отсутствия обновлений или нелицензионного ПО. Хорошая защитная система позволит не дать злоумышленнику воспользоваться уязвимостью.",
      "popUpURL":"/glossary#attack_rce"
   },
   {
      "name":"Фишинг",
      "popUpText":"Фишинг (англ. fishing) -- особая разновидность интернет-мошенничества, целью которой является получение идентификационных данных пользователей, таких как логины и пароли учетных записей, данные банковских карт, аккаунты социальных сетей и многое другое. Обычно для успешного проведения фишинговой атаки злоумышленнику необходимо каким-либо способом уговорить пользователя совершить действия: перейти по ссылке, открыть на своем ПК вредоносный документ, ввести свои данные на постороннем сайте и т.д.\n В зависимости от того, является ли атака таргетированной или осуществляется с целью покрыть как можно большую часть пользователей, злоумышленнику требуется разное время на подготовку и придумывание убедительного аргумента для пользователя в пользу того, чтобы сделать необходимое злоумышленнику. Так, например, во время эпидемии COVID-19 было зафиксировано большое количество фишинговых атак, которые якобы раскрывали информацию о том, как получить бесплатные лекарства или какие народные средства помогают в борьбе с вирусом. Многие из них осуществлялись от имени министерств здравоохранения или других уполномоченных органов. Но важно понимать, что злоумышленник может представиться кем угодно: не только сотрудником министерства, но и Вашим другом, коллегой или родственником. В Игре фишинг разделен на три класса: посредственный, подготовленный и целенаправленный. Важно понимать, что в реальности этих классов может быть выявлено гораздо больше: злоумышленник может позвонить Вам с подмененного номера Вашего родственника или даже отправить цветы с вредоносной флэшкой в комплекте. По-настоящему защитить может, к примеру, двухфакторная аутентификация, которая просто не позволит злоумышленнику, даже получившему пароль, получить доступ к аккаунту. В ряде случаев антивирусы могут распознать ресурс, к которому Вы пытаетесь получить доступ, как фишинговый, и не позволить Вам ввести на нем свои данные. Цифровая подпись письма позволит убедиться, что вы действительно общаетесь с знакомым Вам человеком, а пользовательская осторожность -- не сделать глупость и не открыть файл, если Вы не знаете его автора и не уверены полностью в безопасности.",
      "popUpURL":"/glossary#attack_phishing"
   },
   {
      "name":"Прослушка",
      "popUpText":"Прослушка бывает разная. Обычно под прослушкой понимают ситуацию, когда злоумышленник может прослушать телефонные разговоры. Однако в общем случае этот термин чуть шире -- подслушивать, а точнее, посматривать, можно, например, за Вашими запросами в Интернете.\n Чтобы несколько обезопасить свои звонки, крайне нежелательно пользоваться обычной телефонной связью: мессенджеры, которые поддерживают звонки, чаще всего позволяют их же шифровать, и в этом случае прослушать их гораздо сложнее. А вот чтобы защититься в интернете, очень важно следить за тем, чтобы сайты, которые Вы посещаете, имели сертификат безопасности и соединение с ними шло по протоколу HTTPS. Что же касается электронной почты -- цифровая подпись и шифрование писем позволят избежать вторжения посторонних людей и атак типа Man-in-the-Middle, MitM.",
      "popUpURL":"/glossary#attack_wiretapping"
   },
   {
      "name":"Перехват пакетов Wi-Fi",
      "popUpText":"Общественные сети Wi-Fi представляют собой большую опасность, и вот почему. Подключившись с Вами к одной Wi-Fi точке, другой человек может \"прочесть\" запросы, которые Вы отправляете со своего браузера. Или еще хуже -- он может внедриться в этот трафик. Если речь идет о неизвестной и неконтролируемой Вами точке в гостинице или в аэропорту, то важно понимать, что в этой сети кроме Вас может быть кто угодно. Кроме того, зная, к каким сетям Вы подключались, злоумышленник может легко подделать точку доступа и Ваше устройство может подключиться к ней автоматически. И снова помочь защититься могут отчасти надежные соединения (HTTPS), качественные мессенджеры, поддерживающие шифрование, а также VPN, который позволяет \"обернуть\" Ваш трафик безопасным способом.",
      "popUpURL":"/glossary#attack_wi-fi"
   },
   {
      "name":"Выполнение макросов",
      "popUpText":"Выполнение макросов по умолчанию запрещено в своерменных лицензионных офисных пакетах. И это неудивительно: по сути макросы представляют собой программный код, и разрешать их выполнение - означает ставить под угрозу Ваш ПК. Однако очень часто пользователи это ограничение снимают, чем активно пользуются злоумышленники. Лучше быть осторожным пользователем, который не нарушает рекомендаций безопасности, а также положиться на хорошую защитную систему.",
      "popUpURL":"/glossary#attack_macro"
   },
   {
      "name":"Ваш пароль взломали перебором",
      "popUpText":"Взлом паролей пользователей на разных ресурсах очень часто происходит методом перебора. Злоумышленник выбирает словарь паролей, которые потенциально могли бы подойти на его взгляд, и поочередно проверяет каждый из них. К сожалению, обезопасить Вас от таких атак не могут владельцы сайтов: злоумышленник ведь может менять IP адрес и другие признаки, по которым его можно вычислить. К тому же, очень часто пользователи ставят одинаковые пароли на разных сайтах, а значит, если на одном из сайтов произойдет утечка, то и на всех остальных пользователь будет под угрозой. К тому же, зачастую злоумышленнику очень просто угадать пароли, связанные с именами родственников, датами рождения, адресами и какой-либо другой личной информацией. Защитить от таких атак поможет использование сложных непредсказуемых, а самое главное - разных паролей на всех сайтах, а также двухфакторная аутентификация там, где это возможно.",
      "popUpURL":"/glossary#attack_bruteforce"
   },
   {
      "name":"Устаревшее ПО",
      "popUpText":"Атаки через уязвимости в устаревшем ПО наиболее страшны тем, что что никто не может угадать момент, когда они произойдут. И если какая-либо программа выдает уведомление о том, что ей необходимо обновиться, лучше делать это незамедлительно. Довольно часто такие обновления устраняют ошибки безопасности, которые могут привести, например, к удаленному выполнению кода на Вашем ПК. Поэтому настоятельно рекомендуется своервеменно ставить все необходимые обновления, следить за созданием резервных копий и использовать только лицензионное ПО, которое уж точно напомнит о необходимости обновления своевременно. ",
      "popUpURL":"/glossary#attack_outdated"
   },
   {
      "name":"Вы попали в ботнет",
      "popUpText":"Если Вы попали в ботнет, есть риск, что Вы даже не узнаете об этом. Ботнет - это сеть зараженных компьютеров, которая обычно управляется одним человеком -- хакером, которого еще называют ботоводом. Зараженные компьютеры чаще всего используются для распределенных атак на чужие ресурсы (т.н. DDoS атаки). Однако, если Вы используете лицензионное ПО и надежную защитную систему, то бояться, скорее всего, нечего.",
      "popUpURL":"/glossary#attack_botnet"
   },
   {
      "name": "Антивирус",
      "popUpText": "Антивирус дает целый ряд преимуществ в вопросах защиты от злонамеренных действий. Во-первых, это регулярно обновляемые сигнатуры, во-вторых, так называемая песочница -- изолированная среда, в которой запускаются приложения. Она позволяет проследить, не выполняет ли приложение каких-то действий, которые могут навредить пользователю.",
      "popUpURL": "/glossary#def_antivirus"
   },
   {
      "name": "Двухфакторная аутентификация",
      "popUpText": "Существует множество способов, каким образом злоумышленник может получить Ваш пароль: он может отправить Вам фишинговую ссылку, найти Ваш пароль в базах утечек или узнать его еще каким-либо образом. Однако если аккаунт защищен вторым фактором аутентификации, то для входа в него знания одного лишь пароля недостаточно: для успешной атаки злоумышленнику надо заполучить доступ и ко второму ключу, а это зачастую гораздо сложнее.",
      "popUpURL": "/glossary#def_2fa"
   },
   {
      "name": "Сложные пароли",
      "popUpText": "Использование простых паролей может серьезно облегчить злоумышленнику задачу проведения на Вас атаки. Под простыми паролями понимаются словарные, номера телефонов, пароли, каким-либо образом связанные с Вами и Вашей жизнью, то есть такие, которые можно просто угадать. К примеру, ставить в качестве пароля имя Вашей собаки и дату Вашего рождения - не лучшая идея.",
      "popUpURL": "/glossary#def_passwords"
   },
   {
      "name": "Полнодисковое шифрование",
      "popUpText": "Если Ваш ноутбук попадет в чужие руки, это само по себе неприятно, но многие люди полагаются на то, что он защищен паролем. Однако даже это не спасет, если не зашифрован диск, поскольку его могут снять и физически подключить к другому устройству, пароль от которого злоумышленники будут знать. И тогда все Ваши данные будут для них легко доступны.",
      "popUpURL": "/glossary#def_encryption"
   },
   {
      "name": "Использование VPN",
      "popUpText": "VPN (Virtual Private Network) - технология, которая обеспечивает безопасное, шифрованное соединение между двумя сетями. Говоря простым языком, VPN позволяет зашифровать все Ваши запросы, даже если ресурс, к которому Вы обращаетесь, не поддерживает сертификаты безопасности. Кроме того, если сервер находится в стране, отличной от Вашего местопребывания, то Вы сможете с его помощью получить доступ к ресурсам, недоступным в Вашей стране.",
      "popUpURL": "/glossary#def_vpn"
   },
   {
      "name": "Регулярные обновления",
      "popUpText": "Производители программного обеспечения стараются внимательно следить за всеми ошибками и уязвимостями в своих продуктах, которые могут найти они сами или информация о которых появляется в сети. И стараются как можно быстрее выпустить обновления, содержащие патчи - небольшие кусочки кода, которые исправляют эти уязвимости. Поэтому все программное обеспечение должно своевременно обновляться, ведь зачастую злоумышленнику достаточно и пяти минут, чтобы использовать уязвимость, которую исправляет тот или иной патч.",
      "popUpURL": "/glossary#def_updates"
   },
   {
      "name": "Лицензионное ПО",
      "popUpText": "Взломанное ПО, которое больше не требует лицензии, - достаточно распространенное явление. Однако настоятельно рекомендуем задуматься: а зачем хакерам тратить свое время на то, чтобы взломать то или иное ПО, и выложить его в открытый доступ? К сожалению, исследования показывают, что это делается чаще всего для того, чтобы навердить людям, которые его поставят. Например, сделать их частью ботнета или следить за их действиями в сети. Безусловно, лицензии бывают разные, есть лицензионное ПО, которое распространяется свободно. Главное - не пользоваться взломанными версиями и непроверенными источниками.",
      "popUpURL": "/glossary#def_license"
   },
   {
      "name": "Надежные мессенджеры",
      "popUpText": "SMS-сообщения и телефонные звонки довольно легко перехватывать и подслушивать. Что же делать, если Вы не хотите, чтобы Ваши разговоры и переписки попали в руки злоумышленников? Используйте те мессенджеры, которые предоставляют возможность шифрования разговора и переписки. Выбор, кому из них доверять, непростой, однако этот вопрос стоит решить для себя, чтобы наконец отказаться от старой телефонной связи, которая уж точно небезопасна.",
      "popUpURL": "/glossary#def_messenger"
   },
   {
      "name": "Пользовательская осторожность",
      "popUpText": "К сожалению, чем быстрее развиваются защитные средства, тем хитрее становятся злоумышленники. Социальные инженеры будут пытаться использовать Ваши интересы, увлечения, работу и даже друзей для того, чтобы узнать о Вас как можно больше и создать именно такое письмо, которое Вы откроете, или такую ссылку, по которой Вы перейдете. Поэтому бдительность и аккуратность - одни из самых важных черт современного пользователя в Интернете.",
      "popUpURL": "/glossary#def_caution"
   },
   {
      "name": "Использование HTTPS",
      "popUpText": "Зачастую при посещении сайта мы не обращаем внимания на то, использует ли данный сайт сертификат безопасности. А ведь это важный момент: сертификат является защитой от атак вида Человек посередине (Man-in-the-Middle, MitM), которые позволяют злоумышленнику прочитать все наши запросы к сайту и даже подменить их.",
      "popUpURL": "/glossary#def_https"
   },
   {
      "name": "Регулярные бэкапы",
      "popUpText": "К сожалению, практически каждому человеку знакома ситуация, когда он много месяцев работал над каким-то проектом и почти его завершил, но в самый неподходящий момент с ноутбуком что-то произошло и труды потеряны. А ведь это может быть не только случайность, но и целенаправленная атака, когда ноутбук будет украден или поврежден. Наличие своевременно сделанных резервных копий (бэкапов), которые хранятся на отдельном носителе, может очень сильно помочь в этой ситуации.",
      "popUpURL": "/glossary#def_backups"
   },
   {
      "name": "Цифровая подпись и шифрование писем",
      "popUpText": "Когда Вы разговариваете с человеком лично, довольно легко убедиться, что перед Вами именно тот, кто Вы думаете. Гораздо сложнее сделать это в переписке. Чтобы убедиться, что письмо отправил действительно тот, кто заявлен, а не злоумышленник, который украл его ящик, достаточно проверить цифровую подпись письма. А в случае, если Вы не хотите, чтобы письмо попало в чужие руки, его стоит еще и зашифровать. И тогда получателю будет достаточно знать открытый ключ, а вот посторонний содержимое письма прочесть не сможет.",
      "popUpURL": "/glossary#def_digsig"
   },
   {
      "name": "Уязвимости нулевого дня",
      "popUpText": "Хакеры уже знают об этой ошибке в ПО, а вот его производители о ней еще не догадываются...",
      "popUpURL": "/glossary#accident_0day"
   },
   {
      "name": "Взлом серверов и утечка паролей",
      "popUpText": "Увы, не бывает абсолютно надежных сайтов и приложений. И если сайт был взломан, то можно с уверенностью сказать, что информация о его пользователях уже гле-то продается",
      "popUpURL": "/glossary#accident_leak"
   },
   {
      "name": "Железные бэкдоры",
      "popUpText": "Никто не может защитить Вас от недобросовестных производителей железа, если они захотят собирать о Вас информацию или оставить для себя потайную лазейку в Ваш компьютер. Такое случается нечасто, но никто не может дать гарантий, что этого не произошло с Вашим компьютером.",
      "popUpURL": "/glossary#accident_backdoors"
   },
   {
      "name": "Катаклизмы",
      "popUpText": "Пожары, наводнения, короткие замыкания. Чего только не случается в этом мире. И очень многое из этого может навредить Вашей информации.",
      "popUpURL": "/glossary#accident_cataclysm"
   },
   {
      "name": "Кража ноутбука",
      "popUpText": "21 век на дворе. А от краж никуда не деться. Да и кражи бывают разные.",
      "popUpURL": "/glossary#accident_steal"
   },
   {
      "name": "Блокировка доступа к ресурсам",
      "popUpText": "У блокировок могут быть разные причины. Да и узнать, почему тот или иной ресурс заблокирован Вашим провайдером, бывает очень сложно.",
      "popUpURL": "/glossary#accident_blocking"
   },
   {
      "name": "COVID-19",
      "popUpText": "От коронавируса защитить не может ничто. Отдайте половину своих денег соседу.",
      "popUpURL": "/glossary#accident_covid"
   }
]